In [411]:
# This is Homework 06b (Pandas - Part 2) 
# of the "Data Science" class at Technische Hochschule Rosenheim

In [412]:
class display(object):
    """Display HTML representation of multiple objects"""
    template = """<div style="float: left; padding: 10px;">
    <p style='font-family:"Courier New", Courier, monospace'>{0}</p>{1}
    </div>"""
    def __init__(self, *args):
        self.args = args
        
    def _repr_html_(self):
        return '\n'.join(self.template.format(a, eval(a)._repr_html_())
                         for a in self.args)
    
    def __repr__(self):
        return '\n\n'.join(a + '\n' + repr(eval(a))
                           for a in self.args)

## Pandas - Part 2

### Exercises

#### Starting Up

- import NumPy and Pandas in the usual way and the Series and DataFrame classes from Pandas directly, so you can use them without prefix

In [413]:
## Solutions
import numpy as np
import pandas as pd
from pandas import DataFrame, Series

## Combining Datasets - Concat and Append

### Exercises

### Concatenation

Your ERP system is running on three servers in Germany, Austria and Italy. The employee information saved in these three systems is similar, but not identical:

In [414]:
empg = DataFrame({'emp_name': ['Keller', 'Huber', 'Müller'],
                 'emp_firstname': ['Hans', 'Petra', 'Gabriele'],
                 'dep_number': ['a3', 'a3', 'a1']},
               index = ['25348', '10102', '18316'])
empg.index.name = 'emp_number'

empa = DataFrame({'emp_name': ['Probst', 'Meier'],
                 'emp_firstname': ['Andreas', 'Rainer'],
                 'dep_number': ['a2', 'a2']},
               index = ['29346', '9031'])
empa.index.name = 'emp_number'
display("empg","empa")

empg
           emp_name emp_firstname dep_number
emp_number
25348        Keller          Hans         a3
10102         Huber         Petra         a3
18316        Müller      Gabriele         a1

empa
           emp_name emp_firstname dep_number
emp_number
29346        Probst       Andreas         a2
9031          Meier        Rainer         a2

- output empg and empa
- combine empg and empa into one DataFrame

In [415]:
## Solutions
pd.concat([empg, empa])

           emp_name emp_firstname dep_number
emp_number
25348        Keller          Hans         a3
10102         Huber         Petra         a3
18316        Müller      Gabriele         a1
29346        Probst       Andreas         a2
9031          Meier        Rainer         a2

## Combining Datasets - Merge and Join

### Exercises

An ERP system of a German company contains the following DataFrames with information about departments and employees:

In [416]:
dep = DataFrame({'dep_name': [ 'Beratung', 'Diagnose', 'Freigabe'], 
                 'dep_city': ['München', 'München', 'Stuttgart']}, 
                 index = ['a1', 'a2', 'a3'])
dep.index.name = 'dep_number'

emp = DataFrame({'emp_name': ['Keller', 'Huber', 'Müller', 'Probst', 
                              'Meier', 'Kaufmann', 'Mozer'],
                 'emp_firstname': ['Hans', 'Petra', 'Gabriele', 'Andreas', 
                                   'Rainer', 'Brigitte', 'Sibille'],
                 'dep_number': ['a3', 'a3', 'a1', 'a2', 'a2', 'a2', 'tbd']},
               index = ['25348', '10102', '18316', '29346', '9031', '2581', '28559'])
emp.index.name = 'emp_number'

work = DataFrame({'job': ['Projektleiter', 'Gruppenleiter', 'Sachbearbeiter', '', '', 
                          'Projektleiter', 'Gruppenleiter', '', 'Sachbearbeiter', 
                          'Sachbearbeiter', 'Sachbearbeiter']},
                  index= [['p1', 'p3', 'p2', 'p2', 'p2', 'p3', 
                           'p1', 'p1', 'p2', 'p3', 'p1'], 
                         ['10102', '10102', '25348', '18316', '29346', '2581', 
                          '9031', '28559', '28559', '9031', '29346']])
work.index.names = ['prj_number', 'emp_number']
work.sort_index(inplace=True)

display("dep", "emp", "work")

dep
            dep_name   dep_city
dep_number
a1          Beratung    München
a2          Diagnose    München
a3          Freigabe  Stuttgart

emp
            emp_name emp_firstname dep_number
emp_number
25348         Keller          Hans         a3
10102          Huber         Petra         a3
18316         Müller      Gabriele         a1
29346         Probst       Andreas         a2
9031           Meier        Rainer         a2
2581        Kaufmann      Brigitte         a2
28559          Mozer       Sibille        tbd

work
                                  job
prj_number emp_number
p1         10102        Projektleiter
           28559
           29346       Sachbearbeiter
           9031         Gruppenleiter
p2         18316
           25348       Sachbearbeiter
           28559       Sachbearbeiter
           29346
p3         10102        Gruppenleiter
           2581         Projektleiter
           9031        Sachbearbeiter

- compute the inner join of emp and dep (on the dep_number).
- compute the left outer join of emp and dep (again, on the dep_number).
- compute the full outer join of work and emp (on the emp_number)

In [417]:
## Solutions
aa = emp.merge(dep, "inner", "dep_number")
b = emp.merge(dep, "left", "dep_number")
c = work.merge(emp, "outer", "emp_number")
display("aa", "b", "c")

aa
   emp_name emp_firstname dep_number  dep_name   dep_city
0    Keller          Hans         a3  Freigabe  Stuttgart
1     Huber         Petra         a3  Freigabe  Stuttgart
2    Müller      Gabriele         a1  Beratung    München
3    Probst       Andreas         a2  Diagnose    München
4     Meier        Rainer         a2  Diagnose    München
5  Kaufmann      Brigitte         a2  Diagnose    München

b
   emp_name emp_firstname dep_number  dep_name   dep_city
0    Keller          Hans         a3  Freigabe  Stuttgart
1     Huber         Petra         a3  Freigabe  Stuttgart
2    Müller      Gabriele         a1  Beratung    München
3    Probst       Andreas         a2  Diagnose    München
4     Meier        Rainer         a2  Diagnose    München
5  Kaufmann      Brigitte         a2  Diagnose    München
6     Mozer       Sibille        tbd       NaN        NaN

c
                       job  emp_name emp_firstname dep_number
emp_number
10102        Projektleiter     Huber         Petra         a3
10102        Gruppenleiter     Huber         Petra         a3
28559                          Mozer       Sibille        tbd
28559       Sachbearbeiter     Mozer       Sibille        tbd
29346       Sachbearbeiter    Probst       Andreas         a2
29346                         Probst       Andreas         a2
9031         Gruppenleiter     Meier        Rainer         a2
9031        Sachbearbeiter     Meier        Rainer         a2
18316                         Müller      Gabriele         a1
25348       Sachbearbeiter    Keller          Hans         a3
2581         Projektleiter  Kaufmann      Brigitte         a2

## Aggregation and Grouping

### Exercises

### Aggregation and Computing Descriptive Statistics

You just got the revenue numbers for Italy:

In [418]:
ita = DataFrame({
    '2010': {'Pepe':1500, 'Romano':2500, 'Luigi':3500, 
             'Luigi':4000, 'Maria':2200}, 
    '2011': {'Mario': 6000, 'Maria': 1500, 'Luka': 1000, 
             'Luigi': 5000, 'Eva':10000}, 
    '2012': {'Mario': 3000, 'Romano': 500, 'Maria': 13000, 
             'Eva': 8700, 'Luigi':2900}})
ita.index.name = 'customer'
ita.columns.name='year'
ita.name = 'Italy'
display("ita", "ita.describe()")

ita
year        2010     2011     2012
customer
Pepe      1500.0      NaN      NaN
Romano    2500.0      NaN    500.0
Luigi     4000.0   5000.0   2900.0
Maria     2200.0   1500.0  13000.0
Mario        NaN   6000.0   3000.0
Luka         NaN   1000.0      NaN
Eva          NaN  10000.0   8700.0

ita.describe()
year          2010          2011          2012
count     4.000000      5.000000      5.000000
mean   2550.000000   4700.000000   5620.000000
std    1053.565375   3667.424164   5109.500954
min    1500.000000   1000.000000    500.000000
25%    2025.000000   1500.000000   2900.000000
50%    2350.000000   5000.000000   3000.000000
75%    2875.000000   6000.000000   8700.000000
max    4000.000000  10000.000000  13000.000000

- compute summary descriptives (using the `describe` method) to understand your revenue better
- compute the revenue per year
- compute the revenue per customer
- compute the average revenue per customer

In [419]:
## Solutions
ita.sum()
ita.sum(axis=1)
ita.mean(axis=1)
ita.sum().sum()/len(ita)

8828.57142857143

### Grouping

Let's look at the following DataFrame for the revenue of the USA:

In [420]:
usa = DataFrame({
    '2010': {'Pepe':1500, 'Romano':2500, 'Luigi':3500, 'Luka': 1200,  
             'Luigi':4000, 'Maria':2200, 'Mario': 5000, 'Eva': 0}, 
    '2011': {'Mario': 6000, 'Maria': 1500, 'Luka': 1000, 
             'Luigi': 5000, 'Eva':10000, 'Pepe':1600, 'Romano':2200}, 
    '2012': {'Mario': 3000, 'Romano': 500, 'Maria': 13000, 'Luka': 1000, 
             'Eva': 8700, 'Luigi':2900, 'Pepe':2000}})
usa.index.name = 'customer'
usa.columns.name='year'
usa.name = 'USA'
usa

year      2010   2011   2012
customer
Pepe      1500   1600   2000
Romano    2500   2200    500
Luigi     4000   5000   2900
Luka      1200   1000   1000
Maria     2200   1500  13000
Mario     5000   6000   3000
Eva          0  10000   8700

- compute the average revenue per year
- compute the average revenue per customer
- create a new DataFrame 'usanew' that has only one data column for the revenue and the customer and year as a hierarchical index.
- compute summary statistics on 'usanew' (`describe`) per year

In [421]:
## Solutions
usa.mean()
usa.mean(axis=1)
display("usa.unstack()","usa.unstack().groupby('year').describe()")

AttributeError: 'Series' object has no attribute '_repr_html_'

usa.unstack()
year  customer
2010  Pepe         1500
      Romano       2500
      Luigi        4000
      Luka         1200
      Maria        2200
      Mario        5000
      Eva             0
2011  Pepe         1600
      Romano       2200
      Luigi        5000
      Luka         1000
      Maria        1500
      Mario        6000
      Eva         10000
2012  Pepe         2000
      Romano        500
      Luigi        2900
      Luka         1000
      Maria       13000
      Mario        3000
      Eva          8700
dtype: int64

usa.unstack().groupby('year').describe()
      count         mean          std     min     25%     50%     75%      max
year
2010    7.0  2342.857143  1700.840129     0.0  1350.0  2200.0  3250.0   5000.0
2011    7.0  3900.000000  3295.957119  1000.0  1550.0  2200.0  5500.0  10000.0
2012    7.0  4442.857143  4639.991790   500.0  1500.0  2900.0  5850.0  13000.0

## Pivot Tables

Pivot tables are an extremely useful concept. We will not be using them in this class, nevertheless, if you haven't used them before, I strongly suggest you familiarize yourself with them. Apart from the Pandas methods, they are also availabel in Excel.

## Vectorizing String Operations

### Exercises

#### String Manipulation

Consider the following url:

In [422]:
url = 'http://datascience.inf.fh-rosenheim.de:8000/nice/perl/login?user=klaus&next=true&flag=false&data=xxx'
# scheme =  http://
# host =    datascience.inf.fh-rosenheim.de
# port =    8000
# path =    /nice/perl/
# query =   login?...

## Solutions
scheme = url[:url.find("//")+2]
url = url.replace(scheme,"")

host = url[:url.find(":")]
url = url.replace(host,"")

port = url[:url.find("/")]
url = url.replace(port,"")

path = url[:url.rfind("?")]
url = url.replace(path+"?","")
path = path.replace("/","::")

query = url.split("&")
query_dict = {a:b for a,b in [q.split("=") for q in query]}

print(scheme, host, port, path, query, query_dict)

http:// datascience.inf.fh-rosenheim.de :8000 ::nice::perl::login ['user=klaus', 'next=true', 'flag=false', 'data=xxx'] {'user': 'klaus', 'next': 'true', 'flag': 'false', 'data': 'xxx'}

- use the find, index and []-Python string functions to split this string into the part 'scheme', 'host', 'port', 'path' and 'query'
- replace the '/' in the path with '::'
- use the split method to split the 'query' into it's parts
- extra problem: use a list comprehension to convert the list of query-parts into a dict

#### Vectorized String Functions

Consider the following Series:

In [423]:
addresses = Series({'Susi': 'Haupstr. 1, 83024 Rosenheim, Deutschland', 'Peter': 'Blumenweg 1, 80808 München, Deutschland', 
            'Anton': 'Mozartweg 8, 5020 Salzburg, Österreich', 'Ute': np.nan, 'Olaf': 'Wasserweg 13, 24103 Kiel, Deutschland'})
addresses

Susi     Haupstr. 1, 83024 Rosenheim, Deutschland
Peter     Blumenweg 1, 80808 München, Deutschland
Anton      Mozartweg 8, 5020 Salzburg, Österreich
Ute                                           NaN
Olaf        Wasserweg 13, 24103 Kiel, Deutschland
dtype: object

- Use regular expression matching to vectorize these addresses into street, zip code, city and country (if your regex skills are rusty, read up on the basics, e.g. at https://docs.python.org/3/library/re.html
- compute a Series containing the name and city for each person (Hint: this is not as easy as it sound, if you get confused, use the 'type' method to verify the datatypes of your (intermediate) results)

In [424]:
## Solutions
addresses.str.split(", ").str.lower()

Susi    NaN
Peter   NaN
Anton   NaN
Ute     NaN
Olaf    NaN
dtype: float64

### Indicator Variables

Consider the following DataFrame of persons

In [431]:
person = DataFrame({'name': ['Susi', 'Karin', 'Hans', 'Peter', 'Hias'], 
                    'hair': ['blond', 'red', 'black', 'red', 'blond'],
                    'sex': ['female', 'female', 'male', 'male', 'other']})
person

    name   hair     sex
0   Susi  blond  female
1  Karin    red  female
2   Hans  black    male
3  Peter    red    male
4   Hias  blond   other

- There are a number of Data Mining algorithms that cannot use such a dataset directly - all their input columns need to be numbers. Thus, you need to convert the column 'hair' to three different columns called 'blond', 'red' and 'black' and set exactly one of these to '1' for each row, and all others to '0'. The same need to be done for the 'sex' column. Add these six columns to person.

In [432]:
## Solutions
colors = person["hair"].unique()
genders = person["sex"].unique()
options = (colors,genders)

def recolor(want, ist):
    if ist == want: return 1
    else: return 0

for i, col in enumerate(person.columns[1:3]):
    for goal_val in options[i]:
        person[goal_val] = person[col].apply(lambda actual: recolor(goal_val, actual))

person

    name   hair     sex  blond  red  black  female  male  other
0   Susi  blond  female      1    0      0       1     0      0
1  Karin    red  female      0    1      0       1     0      0
2   Hans  black    male      0    0      1       0     1      0
3  Peter    red    male      0    1      0       0     1      0
4   Hias  blond   other      1    0      0       0     0      1

## Working with Time Series

Handling times and dates is always a considerable challenge in every programming language. Pandas does provide extremely powerful concepts and methods in this area. Unfortunatly, we do not have time to dive into these in this class. If you ever need to analyse time series data, remember that Pandas is very well suited for this task and come back to this section!

## High-Performance Pandas

You can skip this section.

---